app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs"
SELECT  "blogs".* FROM "blogs" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "blogs"
---
  def index
    @blogs = Blog.all
    @blogs = Blog.paginate(page: params[:page], per_page: 10)